import random

# function that gets a face based on a feeling
def ask_user_feeling(feeling: str) -> str:
    feelings = {
        "happy": [
            "(* ^ ω ^)", "(´ ∀ ` *)", "٩(◕‿◕｡)۶", "☆*:.｡.o(≧▽≦)o.｡.:*☆",
            "(o^▽^o)", "(⌒▽⌒)☆", "<(￣︶￣)>", "。.:☆*:･'(*⌒―⌒*)))",
            "ヽ(・∀・)ﾉ", "(´｡• ω •｡`)", "(￣ω￣)", "｀;:゛;｀;･(°ε° )",
            "(o･ω･o)", "(＠＾◡＾)", "ヽ(*・ω・)ﾉ", "(o_ _)ﾉ彡☆"
        ],
        "sad": [
            "(ノ_<。)", "(-_-)", "(´-ω-`)", ".･ﾟﾟ･(／ω＼)･ﾟﾟ･.",
            "(μ_μ)", "(ﾉД`)", "(-ω-、)", "。゜゜(´Ｏ`) ゜゜。",
            "o(TヘTo)", "( ; ω ; )", "(｡╯︵╰｡)", "｡･ﾟﾟ*(>д<)*ﾟﾟ･｡"
        ],
        "mad": [
            "(＃`Д´)", "(`皿´＃)", "( ` ω ´ )", "ヽ( `д´*)ノ",
            "(・`ω´・)", "(`ー´)", "ヽ(`⌒´メ)ノ", "凸(`△´＃)",
            "( `ε´ )", "ψ( ` ∇ ´ )ψ", "ヾ(`ヘ´)ﾉﾞ", "ヽ(‵﹏´)ノ"
        ],
        "soso": [
            "ヽ(ー_ー )ノ", "ヽ(´ー` )┌", "┐(‘～` )┌", "ヽ(　￣д￣)ノ",
            "┐(￣ヘ￣)┌", "ヽ(￣～￣　)ノ", "╮(￣_￣)╭", "ヽ(ˇヘˇ)ノ",
            "¯\\_(ツ)_/¯", "┐(￣～￣)┌", "┐(︶▽︶)┌", "╮(￣～￣)╭"
        ]
    }
    
    feeling_lower = feeling.lower()
    if feeling_lower in feelings:
        return random.choice(feelings[feeling_lower])
    
    return "error: feeling cannot be found"